# Pandas 학습

1. 데이터 분석을 위한 모듈 : 절대적(중학생 과제 작품으로도 사용)
2. excel과 가장 큰 차이점 : Pandas는 대용량 데이터 처리가 가능
3. 데이터 분석 및 데이터 가공에 절대적으로 사용되는 library
4. 주요 학습 내용
> 1. DataFrame - excel의 다수의 컬럼들을 보유한 table과 동일하다 간주
> 2. series - DataFrame을 구성하는 column 간주

**참고**

주피터 노트북 익스텐션을 활용하여 생산성 높이기
>pip install jupyter_contrib_nbextensions && jupyter contrib nbextension install

사용하는 기능

pep8 코딩 컨벤션 체크 및 포멧 정리 기능

목차

In [ ]:
# !pip install jupyter_contrib_nbextensions && jupyter contrib nbextension install

## 기초 익히기
> 이미 존재하는 파일의 내용으로 DataFrame 생성하기 <br>
> 중복 데이터 제거 <br>
> 결측시 처리

## DataFrame  & Series 구조 
> https://pandas.pydata.org/docs/getting_started/index.html <br>

In [9]:
# 전처리를 위한 library import

# as 키워드는 library 별칭 부여 : pd 관습적으로 사용

import pandas as pd
import numpy as np

In [2]:
!pip show pandas

Name: pandas
Version: 1.1.3
Summary: Powerful data structures for data analysis, time series, and statistics
Home-page: https://pandas.pydata.org
Author: None
Author-email: None
License: BSD
Location: c:\users\playdata\anaconda3\lib\site-packages
Requires: pytz, python-dateutil, numpy
Required-by: visions, statsmodels, seaborn, phik, pandas-profiling, mglearn

In [3]:
df = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [22, 35, 58],
        "Sex": ["male", "male", "female"],
    }
)
df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

기초 익히기

In [4]:
# 시리즈 - 정수값으로 생성시 자동으로 int64 (64비트 저장 가능한 정수)
# 시리즈 생성 문법 

s = pd.Series([1, 2, 3]) # 시리즈 객체 
s

0    1
1    2
2    3
dtype: int64

In [5]:
print(s)

0    1
1    2
2    3
dtype: int64

In [6]:
type(s)

pandas.core.series.Series

In [7]:
# 시리즈 객체가 보유한 데이터
s.values

array([1, 2, 3], dtype=int64)

In [8]:
s.index

RangeIndex(start=0, stop=3, step=1)

In [13]:
# 결측치 - 데이터값이 없음을 의미, nan(Not a Number)
# Not a Number : js에서 숫자가 아님을 의미하는 표현법
# python에선 결측치 의미 

# 명시적으로 시리즈에 결측치 적용
# numpy api 결측치 표현 : np.nan

# 데이터를 관리하기 위해서는 간혹 결측치도 임의로 생성해야 할 경우도 있음

s = pd.Series([1, np.nan, 3, 5, 6, np.nan])
s

0    1.0
1    NaN
2    3.0
3    5.0
4    6.0
5    NaN
dtype: float64

In [15]:
# 시리즈가 보유하고 있는 결측치를 제외한 유효한 데이터 개수 counting
s.count()

4

In [17]:
# 가령 데이터로 연산 작업등을 수행
# 최상의 output을 위해서 결측치 처리(삭제? 대체?(평균?, 중앙값? 최빈값?..))

s.fillna(0) # 결측치를 0으로 치환한 새로운 시리즈 생성

s = s.fillna(0) # 0으로 치환한 시리즈를 재 대입 
s

0    1.0
1    0.0
2    3.0
3    5.0
4    6.0
5    0.0
dtype: float64

In [18]:
s = pd.Series([1, np.nan, 3, 5, 6, np.nan])
print(s)

s = s.fillna(10)
print(s)

0    1.0
1    NaN
2    3.0
3    5.0
4    6.0
5    NaN
dtype: float64
0     1.0
1    10.0
2     3.0
3     5.0
4     6.0
5    10.0
dtype: float64

In [19]:
# 결측치 삭제 : dropna()

s = pd.Series([1, np.nan, 3, 5, 6, np.nan])
print(s)

s = s.dropna()
print(s)

0    1.0
1    NaN
2    3.0
3    5.0
4    6.0
5    NaN
dtype: float64
0    1.0
2    3.0
3    5.0
4    6.0
dtype: float64

## 날짜와 문자열 데이터 다루기 


- Python의 datetime모듈

>date : 연, 월, 일

>time : 시간, 분, 초, 마이크로초(백만분의 1초)

>datetime : date와 time요소

- Pandas의 Timestamp

>날짜와 시간 모두 포함 : 나노초(10억분의 1초) 단위의 정밀도


- timedelta

>날짜의 덧셈과 뺄셈에 유용

### 특정 날짜를 기준으로 DataFrame생성해 보기

In [20]:
# 6일치의 날짜 데이터 생성
# date_range(시작일, 범위) : 시작일로 부터 해당 범위 날짜까지 자동 생성

datas = pd.date_range('20210628', periods=6)  
datas

DatetimeIndex(['2021-06-28', '2021-06-29', '2021-06-30', '2021-07-01',
               '2021-07-02', '2021-07-03'],
              dtype='datetime64[ns]', freq='D')

**날짜를 index로 적용해서 DataFrame 객체 생성**

In [21]:
type(datas)

pandas.core.indexes.datetimes.DatetimeIndex

In [22]:
# 6 by 4 : 6행 4열(6X4) 구조의 DataFrame 생성, 데이터는 자동 생성되는 난수값 활용

# 실수의 난수 발생 함수 : 2행 3열의 실수 난수 
np.random.randn(2, 3)

array([[ 1.8292463 , -0.53224109, -0.13750119],
       [-0.68696963, -0.63868226, -0.46296918]])

In [36]:
# 정수의 난수 발생 함수  : 0~11까지의 정수
np.random.randint(12)

3

In [44]:
# randn() : 구조 포함된 난수 발생
# randint() : 범위에 해당하는 하나의 정수값만 발생

np.random.randint(2, 3)  # 2~3 이전까지의 정수 난수 발생

2

In [45]:
# 6행 4열의 구조로 날짜를 보유한 datas 변수값을 index로 구성하는 DataFrame 객체

# Pandas로 데이터 처리시에는 Numpy 모듈을 필수

df = pd.DataFrame(np.random.randn(6, 4), index=datas)
df

                   0         1         2         3
2021-06-28  1.432620  0.647680  1.122270  0.471176
2021-06-29  1.306726 -0.513754  0.709449 -1.995708
2021-06-30  0.585513 -0.618951 -0.816847  1.004319
2021-07-01  0.553226  0.974284 -0.114446  0.614720
2021-07-02  0.241918 -0.513984  0.313991  2.682607
2021-07-03 -1.086599 -0.998600 -0.511486 -0.060802

In [46]:
# 컬럼명 가공

df = pd.DataFrame(np.random.randn(6, 4), index=datas,
                  columns=['a', 'b', 'c', 'd'])
df

                   a         b         c         d
2021-06-28 -0.431592  0.297871  1.224573 -0.007689
2021-06-29  0.115368 -1.150172 -0.236769  0.390818
2021-06-30 -0.599372 -0.669622  0.901317 -0.488415
2021-07-01  1.332254  1.688976 -1.733766 -1.410788
2021-07-02  0.796346 -1.274264 -0.728906 -0.861221
2021-07-03 -1.551994  0.260794 -0.083104 -0.355433

In [50]:
# df의 value
df.values

array([[-0.43159195,  0.29787079,  1.22457282, -0.00768927],
       [ 0.11536847, -1.15017203, -0.23676887,  0.39081832],
       [-0.59937192, -0.66962205,  0.90131739, -0.48841526],
       [ 1.33225381,  1.68897636, -1.73376626, -1.41078796],
       [ 0.79634563, -1.27426417, -0.7289057 , -0.86122147],
       [-1.55199389,  0.2607942 , -0.08310442, -0.35543273]])

In [51]:
# df의 index
df.index

DatetimeIndex(['2021-06-28', '2021-06-29', '2021-06-30', '2021-07-01',
               '2021-07-02', '2021-07-03'],
              dtype='datetime64[ns]', freq='D')

In [52]:
# df의 columns
df.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

In [53]:
# 차후에 ML/DL 시에 데이터 구조를 한눈에 자주 봐야 함

df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2021-06-28 to 2021-07-03
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       6 non-null      float64
 1   b       6 non-null      float64
 2   c       6 non-null      float64
 3   d       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [54]:
# 기초 통계 확인 가능한 함수 
# 가령 빌게이츠  급여가 포함된 동네 주민의 급여들이 활용 데이터라 할 경우
# 이상치? 결측치? 확인을 위해서 기초 통계를 보고 max()에서 빌게이츠 급여와 75% 지정 갭이 너무 
# 크면 이상하다(이상치)로 간주하는 분석 기법도 있음

df.describe()

              a         b         c         d
count  6.000000  6.000000  6.000000  6.000000
mean  -0.056498 -0.141069 -0.109443 -0.455455
std    1.035126  1.121162  1.080768  0.633257
min   -1.551994 -1.274264 -1.733766 -1.410788
25%   -0.557427 -1.030035 -0.605871 -0.768020
50%   -0.158112 -0.204414 -0.159937 -0.421924
75%    0.626101  0.288602  0.655212 -0.094625
max    1.332254  1.688976  1.224573  0.390818

In [56]:
df = pd.DataFrame(np.random.randn(6, 4), index=datas,
                  columns=['a', 'b', 'c', 'd'])
df

                   a         b         c         d
2021-06-28  0.592157 -1.119150  0.632726  0.638602
2021-06-29  0.441203 -1.843905 -1.344676 -0.975196
2021-06-30 -0.161211 -1.745124  1.054624  1.206741
2021-07-01 -0.426858 -0.311244  0.045576 -0.697423
2021-07-02 -0.771526  0.964844  0.554761 -0.449735
2021-07-03 -0.352430  0.956151  0.085954  1.197310

In [57]:
# b 컬럼에 대한 오름차순 정렬 설정
# 오름차순 : ascending=True
# 내림차순 : ascending=False

df.sort_values(by='b', ascending=True)

                   a         b         c         d
2021-06-29  0.441203 -1.843905 -1.344676 -0.975196
2021-06-30 -0.161211 -1.745124  1.054624  1.206741
2021-06-28  0.592157 -1.119150  0.632726  0.638602
2021-07-01 -0.426858 -0.311244  0.045576 -0.697423
2021-07-03 -0.352430  0.956151  0.085954  1.197310
2021-07-02 -0.771526  0.964844  0.554761 -0.449735

In [60]:
# 특정 컬럼들 값만 도출해 보기 
# [] 연산자와 컬럼명으로 컬럼 도출

df['a']

2021-06-28    0.592157
2021-06-29    0.441203
2021-06-30   -0.161211
2021-07-01   -0.426858
2021-07-02   -0.771526
2021-07-03   -0.352430
Freq: D, Name: a, dtype: float64

In [63]:
# dot 연산자를 활용하여 특정 컬럼 검색

df.a

2021-06-28    0.592157
2021-06-29    0.441203
2021-06-30   -0.161211
2021-07-01   -0.426858
2021-07-02   -0.771526
2021-07-03   -0.352430
Freq: D, Name: a, dtype: float64

In [61]:
df['a', 'b']  # error

KeyError: ('a', 'b')

In [62]:
# 하나 이상의 컬럼들은 list 구조로  적용
# df[] : 특정 컬럼을 도출함을 의미하는 문법
# ['a', 'b'] - a와 b 컬럼 의미 
# 다중 컬럼 검색시에는 반드시 list로 변환해서 작업 

df[ ['a', 'b'] ]

                   a         b
2021-06-28  0.592157 -1.119150
2021-06-29  0.441203 -1.843905
2021-06-30 -0.161211 -1.745124
2021-07-01 -0.426858 -0.311244
2021-07-02 -0.771526  0.964844
2021-07-03 -0.352430  0.956151

In [64]:
# index로 데이터 검색(도출)
df.index

DatetimeIndex(['2021-06-28', '2021-06-29', '2021-06-30', '2021-07-01',
               '2021-07-02', '2021-07-03'],
              dtype='datetime64[ns]', freq='D')

In [66]:
# : 기준으로 slicing 해서 데이터 도출
# index 명으로 

df['2021-06-28':'2021-07-01']  # 시작일~끝일자

                   a         b         c         d
2021-06-28  0.592157 -1.119150  0.632726  0.638602
2021-06-29  0.441203 -1.843905 -1.344676 -0.975196
2021-06-30 -0.161211 -1.745124  1.054624  1.206741
2021-07-01 -0.426858 -0.311244  0.045576 -0.697423

In [67]:
# index의 위치값인 순번(index)으로 데이터 도출
# 0 부터 4-1 즉 4이전까지 의미 
df[0:4]

                   a         b         c         d
2021-06-28  0.592157 -1.119150  0.632726  0.638602
2021-06-29  0.441203 -1.843905 -1.344676 -0.975196
2021-06-30 -0.161211 -1.745124  1.054624  1.206741
2021-07-01 -0.426858 -0.311244  0.045576 -0.697423

In [71]:
# iloc 라는 속성을 통해서 검색 -  index location의 약어
# iloc[indexs, columns]

df.iloc[0:2, 0:2]

                   a         b
2021-06-28  0.592157 -1.119150
2021-06-29  0.441203 -1.843905

In [72]:
!dir

 C 드라이브의 볼륨에는 이름이 없습니다.
 볼륨 일련 번호: 3E14-15CC

 C:\202105_lab\07.PythonLib 디렉터리

2021-06-28  오후 12:42    <DIR>          .
2021-06-28  오후 12:42    <DIR>          ..
2021-06-28  오후 12:31    <DIR>          .ipynb_checkpoints
2021-06-28  오전 09:44             1,815 0628_학습내용.txt
2021-06-28  오후 12:31    <DIR>          dataset
2021-06-28  오후 12:42            62,982 step01_PandasBasic_s.ipynb
2021-06-28  오후 12:31            26,947 step02_PandasReview_s.ipynb
               3개 파일              91,744 바이트
               4개 디렉터리  136,304,963,584 바이트 남음

### file로 부터 데이터 read해서 date 타입 이해하기

In [73]:
# 01.date_data.csv
# csv 파일의 내용을 read하면서 DataFrame 객체로 생성

# DataFrame 객체의 장점은 다양한 함수가 있기 때문에 조작 및 정제 가능

# 가정사항 : csv 파일은 제공 받음, 단 raw 는 보존, 정제 및 분석을 위해서는 최적인 상태로
# 가공 필요
# 문제점 찾기 - \t?,  at ?, 


# 사용 빈도가 매우 높음 
df = pd.read_csv('dataset/01.date_data.csv')
df

   Name             Birth                  email
0   이순신   2021-01-01 9:10       happy@gmail.com
1   홍길동   2021-01-08 9:20         1004@NAVER.COM
2   유관순  2021-02-01 10:20   Iron at yahoo.co.kr
3    이이  2021-02-02 11:40        \tlee@gmail.com
4    김구  2021-02-28 15:10         kim@daum.net\t
5   윤봉길  2021-04-10 19:20        yeon@daum.ac.kr
6   강감찬  2021-06-30 21:20          kkc@gmail.com
7  신사임당  2021-07-20 23:30     monther@NAVER.COM
8  을지문덕  2021-08-28 11:48          ygmd@daum.net
9   유재석   2021-09-01 3:12       yjs at gmail.com

In [74]:
# dtypes : 문자열 타입을 object 타입으로 표현

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    10 non-null     object
 1   Birth   10 non-null     object
 2   email   10 non-null     object
dtypes: object(3)
memory usage: 368.0+ bytes

In [75]:
df

   Name             Birth                  email
0   이순신   2021-01-01 9:10       happy@gmail.com
1   홍길동   2021-01-08 9:20         1004@NAVER.COM
2   유관순  2021-02-01 10:20   Iron at yahoo.co.kr
3    이이  2021-02-02 11:40        \tlee@gmail.com
4    김구  2021-02-28 15:10         kim@daum.net\t
5   윤봉길  2021-04-10 19:20        yeon@daum.ac.kr
6   강감찬  2021-06-30 21:20          kkc@gmail.com
7  신사임당  2021-07-20 23:30     monther@NAVER.COM
8  을지문덕  2021-08-28 11:48          ygmd@daum.net
9   유재석   2021-09-01 3:12       yjs at gmail.com

In [77]:
df.columns

Index(['Name', 'Birth', 'email'], dtype='object')

In [79]:
df.values

array([['이순신', '2021-01-01 9:10', 'happy@gmail.com '],
       ['홍길동', '2021-01-08 9:20', '  1004@NAVER.COM'],
       ['유관순', '2021-02-01 10:20', ' Iron at yahoo.co.kr '],
       ['이이', '2021-02-02 11:40', '\tlee@gmail.com'],
       ['김구', '2021-02-28 15:10', 'kim@daum.net\t'],
       ['윤봉길', '2021-04-10 19:20', 'yeon@daum.ac.kr'],
       ['강감찬', '2021-06-30 21:20', 'kkc@gmail.com'],
       ['신사임당', '2021-07-20 23:30', 'monther@NAVER.COM '],
       ['을지문덕', '2021-08-28 11:48', '    ygmd@daum.net'],
       ['유재석', '2021-09-01 3:12', 'yjs at gmail.com']], dtype=object)

In [80]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [81]:
df['Birth']

0     2021-01-01 9:10
1     2021-01-08 9:20
2    2021-02-01 10:20
3    2021-02-02 11:40
4    2021-02-28 15:10
5    2021-04-10 19:20
6    2021-06-30 21:20
7    2021-07-20 23:30
8    2021-08-28 11:48
9     2021-09-01 3:12
Name: Birth, dtype: object

In [82]:
df.Birth

0     2021-01-01 9:10
1     2021-01-08 9:20
2    2021-02-01 10:20
3    2021-02-02 11:40
4    2021-02-28 15:10
5    2021-04-10 19:20
6    2021-06-30 21:20
7    2021-07-20 23:30
8    2021-08-28 11:48
9     2021-09-01 3:12
Name: Birth, dtype: object

In [83]:
# object 즉 문자열 타입을 datetime 타입으로 변환 하는 구조

df['Birth'] = pd.to_datetime(df['Birth'], format='%Y-%m-%d %H:%M:%S')
df

   Name               Birth                  email
0   이순신 2021-01-01 09:10:00       happy@gmail.com
1   홍길동 2021-01-08 09:20:00         1004@NAVER.COM
2   유관순 2021-02-01 10:20:00   Iron at yahoo.co.kr
3    이이 2021-02-02 11:40:00        \tlee@gmail.com
4    김구 2021-02-28 15:10:00         kim@daum.net\t
5   윤봉길 2021-04-10 19:20:00        yeon@daum.ac.kr
6   강감찬 2021-06-30 21:20:00          kkc@gmail.com
7  신사임당 2021-07-20 23:30:00     monther@NAVER.COM
8  을지문덕 2021-08-28 11:48:00          ygmd@daum.net
9   유재석 2021-09-01 03:12:00       yjs at gmail.com

In [84]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    10 non-null     object
 1   Birth   10 non-null     datetime64[ns]
 2   email   10 non-null     object
dtypes: datetime64[ns](1), object(2)
memory usage: 368.0+ bytes

In [85]:
df['Birth']

0   2021-01-01 09:10:00
1   2021-01-08 09:20:00
2   2021-02-01 10:20:00
3   2021-02-02 11:40:00
4   2021-02-28 15:10:00
5   2021-04-10 19:20:00
6   2021-06-30 21:20:00
7   2021-07-20 23:30:00
8   2021-08-28 11:48:00
9   2021-09-01 03:12:00
Name: Birth, dtype: datetime64[ns]

In [90]:
# '2019-01-01' : 문자열
# pd.to_datetime('2019-01-01') : 문자열을 datetime 즉 날짜 표현 타입으로 변환
# - : 경과일

eday = df['Birth'] - pd.to_datetime('2019-01-01')
eday

0   731 days 09:10:00
1   738 days 09:20:00
2   762 days 10:20:00
3   763 days 11:40:00
4   789 days 15:10:00
5   830 days 19:20:00
6   911 days 21:20:00
7   931 days 23:30:00
8   970 days 11:48:00
9   974 days 03:12:00
Name: Birth, dtype: timedelta64[ns]

###  경과일 계산

- timedelta64[??]  : 날짜의 덧셈과 뺄셈에 유용
  - Y : 연단위로 자동 계산
  - M : 월단위로 자동 계산
  - D : 일 
  - m : 분 
  - s : 초

In [95]:
# 경과일을 day 즉 일을 기준으로 일 데이터만 도출
# 아쉬운 점 : . 표현 의미 없을 경우 삭제 시도 astype() 함수로 체이닝 기술 적용 
eday.astype('timedelta64[D]')

0    731.0
1    738.0
2    762.0
3    763.0
4    789.0
5    830.0
6    911.0
7    931.0
8    970.0
9    974.0
Name: Birth, dtype: float64

In [96]:
# 최종적으론 int로 정제
eday.astype('timedelta64[D]').astype('int')

0    731
1    738
2    762
3    763
4    789
5    830
6    911
7    931
8    970
9    974
Name: Birth, dtype: int32

## 인덱서(indexer)

### iloc(index location)
- 데이터 프레임의 부분집합 선택을 위한 도구
- iloc는 정수로만 선택
- 여러 개의 정수 위치를 선택하려면 리스트 전달
- 동일한 간격으로 선택하려면 슬라이스 표기
- iloc[index] or iloc[index, column]

In [97]:
df = pd.read_csv('dataset/01.date_data.csv')
df

   Name             Birth                  email
0   이순신   2021-01-01 9:10       happy@gmail.com
1   홍길동   2021-01-08 9:20         1004@NAVER.COM
2   유관순  2021-02-01 10:20   Iron at yahoo.co.kr
3    이이  2021-02-02 11:40        \tlee@gmail.com
4    김구  2021-02-28 15:10         kim@daum.net\t
5   윤봉길  2021-04-10 19:20        yeon@daum.ac.kr
6   강감찬  2021-06-30 21:20          kkc@gmail.com
7  신사임당  2021-07-20 23:30     monther@NAVER.COM
8  을지문덕  2021-08-28 11:48          ygmd@daum.net
9   유재석   2021-09-01 3:12       yjs at gmail.com

In [98]:
df.iloc[2]

Name                       유관순
Birth         2021-02-01 10:20
email     Iron at yahoo.co.kr
Name: 2, dtype: object

In [99]:
df

   Name             Birth                  email
0   이순신   2021-01-01 9:10       happy@gmail.com
1   홍길동   2021-01-08 9:20         1004@NAVER.COM
2   유관순  2021-02-01 10:20   Iron at yahoo.co.kr
3    이이  2021-02-02 11:40        \tlee@gmail.com
4    김구  2021-02-28 15:10         kim@daum.net\t
5   윤봉길  2021-04-10 19:20        yeon@daum.ac.kr
6   강감찬  2021-06-30 21:20          kkc@gmail.com
7  신사임당  2021-07-20 23:30     monther@NAVER.COM
8  을지문덕  2021-08-28 11:48          ygmd@daum.net
9   유재석   2021-09-01 3:12       yjs at gmail.com

In [100]:
df.iloc[0, 0]

'이순신'

In [102]:
df.iloc[1, 1]

'2021-01-08 9:20'

In [105]:
df.head()  # DataFrame의 앞 부분 영역 5개의 index 반환

  Name             Birth                  email
0  이순신   2021-01-01 9:10       happy@gmail.com
1  홍길동   2021-01-08 9:20         1004@NAVER.COM
2  유관순  2021-02-01 10:20   Iron at yahoo.co.kr
3   이이  2021-02-02 11:40        \tlee@gmail.com
4   김구  2021-02-28 15:10         kim@daum.net\t

In [103]:
df.iloc[1:3, 0]

1    홍길동
2    유관순
Name: Name, dtype: object

In [107]:
df.iloc[4, 2]

'kim@daum.net\t'

In [108]:
# index 1~2까지의 모든 컬럼(DataFrame 관점에선 시리즈) 검색 
df.iloc[1:3, :]

  Name             Birth                  email
1  홍길동   2021-01-08 9:20         1004@NAVER.COM
2  유관순  2021-02-01 10:20   Iron at yahoo.co.kr

### loc 속성

- 데이터들을 slicing 하는 기술
- loc[index, columns]
- loc는 레이블로만 선택
- 여러 개의 레이블을 선택하려면 리스트 전달
- 동일한 간격으로 선택하려면 슬라이스 표기 사용
- 마지막 레이블까지 포함

In [112]:
df = pd.read_csv('dataset/01.date_data.csv')
df.tail(3)

   Name             Birth               email
7  신사임당  2021-07-20 23:30  monther@NAVER.COM
8  을지문덕  2021-08-28 11:48       ygmd@daum.net
9   유재석   2021-09-01 3:12    yjs at gmail.com

In [113]:
# 모든 row들이면서 Name, Birth 시리즈 값만 반환
df.loc[:, ['Name', 'Birth']]

   Name             Birth
0   이순신   2021-01-01 9:10
1   홍길동   2021-01-08 9:20
2   유관순  2021-02-01 10:20
3    이이  2021-02-02 11:40
4    김구  2021-02-28 15:10
5   윤봉길  2021-04-10 19:20
6   강감찬  2021-06-30 21:20
7  신사임당  2021-07-20 23:30
8  을지문덕  2021-08-28 11:48
9   유재석   2021-09-01 3:12

In [118]:
# 데이터 수정
print(df.iloc[0, 0])
print(df.loc[0, 'Name'])

이순신
이순신

In [187]:
df.loc[0, 'Name'] = '김순신'
df.head()

    이름  나이   직업  hobby Name
0  신동엽  20  연예인  music  김순신
1  유재석  41   교수    art  NaN
2  김새롬  18   학생  study  NaN
3  이영자  45  상담사   talk  NaN
4  강호동  38  연예인   talk  NaN

In [194]:
# 새로운 시리즈(칼럼) 추가
df = pd.read_csv('dataset/01.date_data.csv')
df['age'] = range(10,101,10)
df.head(1)
del df['age']

- file로 부터 데이터 read해서 dataFrame
- dataframe 특정 데이터값 착출,수정,추가

### 이미 존재하는 파일의 내용을 기반으로 DataFrame 생성하기

In [202]:
df = pd.read_csv('dataset/03.friendsTab.txt')
df
# tab으로 데이터 구분 -> tab seperated value(tsv) -> *.tsv
# txt 파일엔 문제가 없는데, DataFrame 변환 시 문제 발생
# 해결책 : read.csv 에 구분자 속성으로 ,가 아닌tab 구분자로 
# delimiter 를 사용하여 구분자를 결정
df = pd.read_csv('dataset/03.friendsTab.txt' , delimiter ='\t')
print(df)

    이름  나이   직업  hobby
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

In [198]:
type(df)

pandas.core.frame.DataFrame

In [203]:
df.loc[3,'나이']

45

In [208]:
df = pd.read_csv('dataset/04.friendsTabNoHead.txt', delimiter='\t')
df.columns

Index(['신동엽', '20', '연예인', 'music'], dtype='object')

In [212]:
df = pd.read_csv('dataset/04.friendsTabNoHead.txt', delimiter='\t',header = None)

In [220]:
# 칼럼 추가 시 names 라는 속성 활용
df = pd.read_csv('dataset/04.friendsTabNoHead.txt',
                 delimiter='\t', names=['이름', 'age', 'job', 'hobby'])
print(df)
# df['sal']= 0
# df

    이름  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [224]:
# 3항 연산자 :  조건식? 조건식이 true 일때 실행, 조건식이 false일때 실행
df['job'] == '학생'


df['sal'] = np.where( df['job'] != '학생', 'yes', 'no')
df

    이름  age  job  hobby  sal
0  신동엽   20  연예인  music  yes
1  유재석   41   교수    art  yes
2  김새롬   18   학생  study   no
3  이영자   45  상담사   talk  yes
4  강호동   38  연예인   talk  yes

In [230]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
                    {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
                    {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name':  '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'}]
type(friend_dict_list)

list

In [231]:
df = pd.DataFrame(friend_dict_list)
print(df)
print(type(df))

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
<class 'pandas.core.frame.DataFrame'>

### 중복 데이터 제거 기술

In [233]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
                    {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
                    {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name':  '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'},
                    {'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'}]

df = pd.DataFrame(friend_dict_list)
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

In [234]:
# duplicated 결과값으로 true인 놈을 삭제.
df = df.drop_duplicates() # 복제본 삭제.
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [235]:
# step02 - 속성으로 선별해서 삭제

friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' :  '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'},
                    {'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'} ]

df = pd.DataFrame(friend_dict_list)
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   20  연예인  music

In [236]:
df.drop_duplicates(keep='last')

  name  age  job  hobby
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   20  연예인  music

In [ ]:
# step03 - 동명이인일 경우에 선별해서 삭제

friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
                    {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
                    {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name':  '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'},
                    {'name': '신동엽', 'age': 50, 'job': '연예인', 'hobby': 'music'}]

df = pd.DataFrame(friend_dict_list)
df

In [237]:
# 원본 DataFrame에서 새로 생성된 DataFrame 객체.
# df에 대입하지 않을 경우 원본은 유지.
df.drop_duplicates('name',keep='last')

  name  age  job  hobby
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   20  연예인  music

In [ ]:
# step04 - 원본 DataFrame 자체에 수정 사항 바로 반영하는 속성

friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
                    {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
                    {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name':  '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'},
                    {'name': '신동엽', 'age': 50, 'job': '연예인', 'hobby': 'music'}]

df = pd.DataFrame(friend_dict_list)
df

In [238]:
df.drop_duplicates('name',keep='last',inplace = True)

### 결측치 처리

In [272]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
                    {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
                    {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name':  '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'},
                    {'name': '신동엽', 'age': None, 'job': '연예인', 'hobby': 'music'}]
df = pd.DataFrame(friend_dict_list)
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽   NaN  연예인  music

In [277]:
# index명 5라는 위치의 신동엽의 age는 결측치
# info() 로 non-null 값으로 결측치 여부 확인 가능

# 저 결측치를 어떻게 처리 할까?
# age는 절대 결측치일리가 없음, 나이가 없는 친구가 없기 때문
# age의 Non은 어떻게 할까? 지울까? 대체?(평균? 중앙값? 최빈값?...)
# df.info()
# df['age'] = np.where(df['age'] is None, df['age'].mean())
# df['age'].sum()
df.fillna(df['age'].mean(), inplace=True)
print(df)
# df
# np.where( df['job'] != '학생', 'yes', 'no')

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽  32.4  연예인  music

### 그룹화 하기

In [279]:
# None 값을 0 값으로 치환

friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
                    {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
                    {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name':  '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'},
                    {'name': '신동엽', 'age': None, 'job': '연예인', 'hobby': 'music'}]

df = pd.DataFrame(friend_dict_list)
df['age'].fillna(df['age'].mean(), inplace=True)
df.groupby('job')

In [282]:
df['job'].unique()
df['job'].value_counts()

연예인    3
교수     1
학생     1
상담사    1
Name: job, dtype: int64

In [285]:
df.groupby('job').mean()

           age
job
교수   41.000000
상담사  45.000000
연예인  30.133333
학생   18.000000

In [287]:
df['job'].unique()

array(['연예인', '교수', '학생', '상담사'], dtype=object)

In [294]:
df.iloc[5,1] = np.nan
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽   NaN  연예인  music

In [295]:
df.groupby('job')['age'].transform('median')

0    29.0
1    41.0
2    18.0
3    45.0
4    29.0
5    29.0
Name: age, dtype: float64

In [297]:
# 결측치 중앙값으로 치환
# 각 job 별로 중앙값ㅇ
df['age'] = df.groupby('job')['age'].transform('median')
df

  name   age  job  hobby
0  신동엽  29.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  29.0  연예인   talk
5  신동엽  29.0  연예인  music

1. job 종류 확인 : unique()
2. job 별 개수 확인 :  value_counts()

In [303]:
# 데이터 제공

friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
                    {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
                    {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name': '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'},
                    {'name': '신동엽', 'age': None, 'job': '연예인', 'hobby': 'music'},
                    {'name': '고현정', 'age': 44, 'job': '가수', 'hobby': 'music'},
                    {'name': '박민영', 'age': 22, 'job': '학생', 'hobby': 'art'},
                    {'name': '박서준', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '박보검', 'age': 40, 'job': '상담사', 'hobby': 'talk'},
                    {'name': '이효리', 'age': 28, 'job': '교수', 'hobby': 'talk'},
                    {'name': '이상순', 'age': 29, 'job': '주부', 'hobby': 'music'}]

df = pd.DataFrame(friend_dict_list)
df
df['age'] = df.groupby('job')['age'].transform('median')
df

# df['job'].value_counts()

   name   age  job  hobby
0   신동엽  29.0  연예인  music
1   유재석  34.5   교수    art
2   김새롬  18.0   학생  study
3   이영자  42.5  상담사   talk
4   강호동  29.0  연예인   talk
5   신동엽  29.0  연예인  music
6   고현정  44.0   가수  music
7   박민영  18.0   학생    art
8   박서준  18.0   학생  study
9   박보검  42.5  상담사   talk
10  이효리  34.5   교수   talk
11  이상순  29.0   주부  music

### 조건 기반 필터링

- Pandas의 비교 및 논리 연산자
- 비교 연산자는 기본 연산자를 사용
- AND : &
- OR : |
- NOT : ~
- 논리 연산에 기본 연산자를 사용할 경우 객체
전체의 참을 계산하기 때문에 오류 발생
- 각 표현은 괄호로 묶는 것은 권장

In [309]:
f1 = df.name == '김새롬'
f2 = df.job == '학생'
f1 & f2

0     False
1     False
2      True
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
dtype: bool

In [311]:
df2 = df[f1 & f2]
df2

  name   age job  hobby
2  김새롬  18.0  학생  study

### 두개의 DataFrame 병합하기 - row 기준

In [312]:
l1 = [{'name': '이효리', 'job': "교수"},
      {'name': '이상순', 'job': "학생"},
      {'name': '박보검', 'job': "개발자"}]

l2 = [{'name': '신동엽', 'job': "치과의사"},
      {'name': '이영자', 'job': "농부"},
      {'name': '정찬우', 'job': "연예인"}]

In [313]:
df1 = pd.DataFrame(l1, columns=['name', 'job'])
df2 = pd.DataFrame(l2, columns=['name', 'job'])

print(df1)
print(type(df1))
print(df1.ndim) # 차원수
print(df1.shape) # 행렬수

print('-'*20)

print(df2)

  name  job
0  이효리   교수
1  이상순   학생
2  박보검  개발자
<class 'pandas.core.frame.DataFrame'>
2
(3, 2)
--------------------
  name   job
0  신동엽  치과의사
1  이영자    농부
2  정찬우   연예인

In [315]:
df_all = pd.concat([df1,df2])
df_all

  name   job
0  이효리    교수
1  이상순    학생
2  박보검   개발자
0  신동엽  치과의사
1  이영자    농부
2  정찬우   연예인

In [320]:
df_all = pd.concat([df1,df2], axis =0, ignore_index=True)
df_all

  name   job
0  이효리    교수
1  이상순    학생
2  박보검   개발자
3  신동엽  치과의사
4  이영자    농부
5  정찬우   연예인

<hr>

**미션**

1. hobby 종류 확인
2. hobby 종류의 총수 확인
3. 종류별 개수

In [327]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
                    {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
                    {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name':  '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'},
                    {'name': '신동엽', 'age': None, 'job': '연예인', 'hobby': 'music'}]

df = pd.DataFrame(friend_dict_list)
df['age'].fillna(df['age'].mean(), inplace=True)
print(df.hobby.unique())
print(len(df.hobby.unique()))
print(df.hobby.value_counts())

['music' 'art' 'study' 'talk']
4
talk     2
music    2
study    1
art      1
Name: hobby, dtype: int64